Tekla.Structures.Dialog.Data.Native.dotMaterialType
The Tekla.Structures.Dialog.Data.Native.dotMaterialType enum defines the different types of material supported by Tekla Structures.

Tekla.Structures.Dialog.Data.Native.dotMaterialType.Steel
The steel material.

Tekla.Structures.Dialog.Data.Native.dotMaterialType.Concrete
The concrete material.